# Условный оператор

#Порядок выполнениә операций в Python
# 1. ()
# 2. **
# 3. *, / ,//, %
# 4. +, -
# 5. < ,>, <= , >= , == , !=
# 6. not (Инверсия, логическое отрицание)
# 7. and (конъюкция, логические умножения)
# 8. or (дизЪюнкция, логическое сложение)

num_1= 10
num_2 = 16
if num_1  % 10 == 5 or num_2 % num_2 % == 0 # false or True
    print('hello')



num = int(input())

if num > 0:
    print('+')
elif num < 0:
    print('-')
else:
    print('Hello')



#############################################
num = int(input())
if num < 100
    print("Некоректные данные")
if 0 <= num < 7:
    print("Дошкольник")
elif 7 >= num < 18:
    print('Школьник')
elif 18 >= num < 22:
    print('Студент')
elif 22 >= num < 65:
    print('Рабочий')
else:
    print('пенсионер')
